raohassandev/esp32_firmware/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_ESP_TASK_WDT_EN=y
CONFIG_ESP_TASK_WDT_TIMEOUT_S=5
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
# Shared by httpd, the Modbus TCP client, DHCP and DNS. httpd reserves 3 on top
# of its max_open_sockets, so 12 left nothing spare once the web server was
# sized for a browser's keep-alive connections.
CONFIG_LWIP_MAX_SOCKETS=16

# The DevKitC-1 N16R8 carries 8 MB of octal PSRAM that was going unused while
# minimum free internal heap fell to 40 kB and internal fragmentation reached
# 29%. That shortage is what makes large JSON responses fail intermittently.
# Allocations above the threshold go to PSRAM; small and ISR-safe allocations
# stay internal.
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=4096
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y
CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024
CONFIG_HTTPD_MAX_URI_LEN=256
# Production/dev defaults intentionally contain no STA SSID/password. A fresh
# controller enters its setup AP and commissioned credentials stay in NVS.
CONFIG_PVDG_DEFAULT_ZLAN_HOST="192.168.100.200"
